#pragma once

#include <SFML/Window.hpp>
#include <SFML/Graphics.hpp>

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

namespace ViewLib
{
    /**
     * @brief Класс, который можно где-то нарисовать.
    */
    class IRender
    {
    public:
        /**
         * @brief Нарисовать данный класс в target.
         * 
         * @param target Где нарисовать данный класс.
        */
        virtual void Render(sf::RenderTarget& target) = 0;
    };

    /**
     * @brief Класс, в котором можно что-то нарисовать.
    */
    class IRenderTarget
    {
    public:
        /**
         * @brief Нарисовать drawable в данном классе.
         * 
         * @param drawable Что нарисовать.
        */
        virtual void Render(IRender& drawable) = 0;
    };
}

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///